hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_80k/system/fluid/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 1;

method          scotch;

regions
{
    solid
    {
        numberOfSubdomains 1;
        method      scotch;

        coeffs
        {
            n       (2 2 1);
        }
    }
}

coeffs
{
    n       (2 2 1);
}


// ************************************************************************* //
